def print_return(*args, sep=' ', end='\n') -> str:
    print(f'ОТЛАДКА: переданные аргументы\n  {args = }')
    return sep.join(str(arg) for arg in args) + end


# >>> print_return(1)
# ОТЛАДКА: переданные аргументы
#   args = (1,)
# '1\n'
# >>>
# >>> print_return(1, 'abc', 0.2)
# ОТЛАДКА: переданные аргументы
#   args = (1, 'abc', 0.2)
# '1 abc 0.2\n'
# >>>
# >>> print_return(*range(20), 40, 60)
# ОТЛАДКА: переданные аргументы
#   args = (0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19
# , 40, 60)
# '0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 40 60\n'
# >>>
# >>> print_return(0, *range(2, 20, 3), 100, sep='_', end='')
# ОТЛАДКА: переданные аргументы
#   args = (0, 2, 5, 8, 11, 14, 17, 100)
# '0_2_5_8_11_14_17_100'

