# >>> number = 582
# >>> word = 'python!'
# >>>
# >>> globals()
# {'__name__': '__main__', ..., 'number': 582, 'word': 'python!'}

codes = ('04fa', '04d1', '051b')

# функция возвращает словароподобное представление глобального пространства имён
# >>> globals()
# {'__name__': '__main__', ..., 'codes': ('04fa', '04d1', '051b')}

# глобальное пространство имён - пространство имён модуля __main__

# >>> globals()['codes']
# ('04fa', '04d1', '051b')

# >>> var_name = 'codes'
# >>>
# >>> globals()[var_name]
# ('04fa', '04d1', '051b')
